#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.desksharing.github_repository.main: Refreshing state... [id=desksharing]
module.codelabs.github_repository.main: Refreshing state... [id=codelabs]
module.ALLIERAlexandre.data.github_user.main: Refreshing state...
module.developers.github_team.main: Refreshing state... [id=642624]
module.JACQUEMINArthur.data.github_user.main: Refreshing state...
module.CIEPKAJeanBaptiste.data.github_user.main: Refreshing state...
module.hq.github_team.main: Refreshing state... [id=2362575]
module.SOLOMEmmanuel.data.github_user.main: Refreshing state...
module.ABDELLOULounis.data.github_user.main: Refreshing state...
module.FRUITDimitri.data.github_user.main: Refreshing state...
module.JOSEPHMarianne.data.github_user.main: Refreshing state...
module.BOTWilson.data.github_user.main: Refreshing state...
module.CADOUXMartin.data.github_user.main: Refreshing state...
module.BRENOTPierre.data.github_user.main: Refreshing state...
module.CUNSOLOGiuseppe.data.github_user.main: Refreshing state...
module.DUVALDavid.data.github_user.main: Refreshing state...
module.design-system.github_repository.main: Refreshing state... [id=design-system]
module.typescript-boilerplates.github_repository.main: Refreshing state... [id=typescript-boilerplates]
module.trainings.github_repository.main: Refreshing state... [id=trainings]
module.BELETFabiola.data.github_user.main: Refreshing state...
module.wheel-of-fortune.github_repository.main: Refreshing state... [id=wheel-of-fortune]
module.github.github_repository.main: Refreshing state... [id=github]
module.eslint-config.github_repository.main: Refreshing state... [id=eslint-config]
module.nebula_react.github_repository.main: Refreshing state... [id=nebula-react]
module.BOILLONYannick.data.github_user.main: Refreshing state...
module.KANIANoel.data.github_user.main: Refreshing state...
module.JARDINETRemy.data.github_user.main: Refreshing state...
module.RAMEAUBenoit.data.github_user.main: Refreshing state...
module.infra.github_repository.main: Refreshing state... [id=infra]
module.THIBAULTGuillaume.data.github_user.main: Refreshing state...
module.eleven-labs_com.github_repository.main: Refreshing state... [id=eleven-labs.com]
module.CORDIERKevin.data.github_user.main: Refreshing state...
module.MINASYANMarie.data.github_user.main: Refreshing state...
module.core.github_team.main: Refreshing state... [id=540795]
module.wilsoncodingbattlespace_com.github_repository.main: Refreshing state... [id=wilsoncodingbattlespace.com]
module.DIOURIYounes.data.github_user.main: Refreshing state...
module.DJOHERRyan.data.github_user.main: Refreshing state...
module.infra_team.github_team.main: Refreshing state... [id=7595996]
module.WALLACEAntoine.data.github_user.main: Refreshing state...
module.black_hole.github_repository.main: Refreshing state... [id=black-hole]
module.LEROUGEPierre.data.github_user.main: Refreshing state...
module.BOUCQUETOTYann.data.github_user.main: Refreshing state...
module.GREVINNicolas.data.github_user.main: Refreshing state...
module.BETHMONTThomas.data.github_user.main: Refreshing state...
module.BERTHETJeanBaptiste.data.github_user.main: Refreshing state...
module.FERTDimitri.data.github_user.main: Refreshing state...
module.PIERRELOUISMatthieu.data.github_user.main: Refreshing state...
module.amp-jekyll.github_repository.main: Refreshing state... [id=amp-jekyll]
module.LENGLETMartin.data.github_user.main: Refreshing state...
module.AMARAAntoine.data.github_user.main: Refreshing state...
module.MIGEOTDEBARANFabrice.data.github_user.main: Refreshing state...
module.THUONThierry.data.github_user.main: Refreshing state...
module.MOUTTEAnthony.data.github_user.main: Refreshing state...
module.CHARRONMaeva.data.github_user.main: Refreshing state...
module.DEBANDTJulien.data.github_user.main: Refreshing state...
module.blog_eleven-labs_com.github_repository.main: Refreshing state... [id=blog.eleven-labs.com]
module.PEAUDECERFMarion.data.github_user.main: Refreshing state...
module.LEROYPierrick.data.github_user.main: Refreshing state...
module.REGAIBIIlyace.data.github_user.main: Refreshing state...
module.LOVERGNEClement.data.github_user.main: Refreshing state...
module.LALOUMMichael.data.github_user.main: Refreshing state...
module.MENNACristiane.data.github_user.main: Refreshing state...
module.FEIREISENBenjamin.data.github_user.main: Refreshing state...
module.ANDREAlexandre.data.github_user.main: Refreshing state...
module.GORRONCharlesEric.data.github_user.main: Refreshing state...
module.CHARDENALMatthieu.data.github_user.main: Refreshing state...
module.BERNARDJeremy.data.github_user.main: Refreshing state...
module.KONTOMARKOSSophie.data.github_user.main: Refreshing state...
module.LABIEDHKaies.data.github_user.main: Refreshing state...
module.PASQUETFabien.data.github_user.main: Refreshing state...
module.DELPEYROUXVictor.data.github_user.main: Refreshing state...
module.DEMELLIERRomain.data.github_user.main: Refreshing state...
module.EINHORNStephane.data.github_user.main: Refreshing state...
module.DUNGKevin.data.github_user.main: Refreshing state...
module.WILSON.data.github_user.main: Refreshing state...
module.api-validator.github_repository.main: Refreshing state... [id=api-validator]
module.BERRYElsa.data.github_user.main: Refreshing state...
module.MOATIJacques.data.github_user.main: Refreshing state...
module.PEJOUTThomas.data.github_user.main: Refreshing state...
module.CLAVIERAnais.data.github_user.main: Refreshing state...
module.BESSOUDOSebastien.data.github_user.main: Refreshing state...
module.LANAUGregory.data.github_user.main: Refreshing state...
module.XUAlexandre.data.github_user.main: Refreshing state...
module.CANALGuillem.data.github_user.main: Refreshing state...
module.jekyll-multiple-languages-plugin.github_repository.main: Refreshing state... [id=jekyll-multiple-languages-plugin]
module.AMARBenjamin.data.github_user.main: Refreshing state...
module.OUNALLIMarwa.data.github_user.main: Refreshing state...
module.SURPierre.data.github_user.main: Refreshing state...
module.POINTURIERLucas.data.github_user.main: Refreshing state...
module.NAULINThomas.data.github_user.main: Refreshing state...
module.TRAPANIMariaEugenia.data.github_user.main: Refreshing state...
module.GRAILLONRobin.data.github_user.main: Refreshing state...
module.FLORANTLoris.data.github_user.main: Refreshing state...
module.desksharing.github_issue_label.main[6]: Refreshing state... [id=desksharing:type/fix]
module.desksharing.github_issue_label.main[0]: Refreshing state... [id=desksharing:status/depend]
module.desksharing.github_issue_label.main[5]: Refreshing state... [id=desksharing:type/feat]
module.desksharing.github_issue_label.main[2]: Refreshing state... [id=desksharing:status/reviewable]
module.desksharing.github_issue_label.main[8]: Refreshing state... [id=desksharing:type/refactor]
module.desksharing.github_issue_label.main[9]: Refreshing state... [id=desksharing:type/test]
module.desksharing.github_issue_label.main[1]: Refreshing state... [id=desksharing:status/mergeable]
module.desksharing.github_issue_label.main[7]: Refreshing state... [id=desksharing:type/question]
module.desksharing.github_issue_label.main[4]: Refreshing state... [id=desksharing:type/chore]
module.desksharing.github_issue_label.main[3]: Refreshing state... [id=desksharing:status/wip]
module.ALLIERAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:aallier]
module.codelabs.github_repository_webhook.main[0]: Refreshing state... [id=77131724]
module.codelabs.github_repository_webhook.main[1]: Refreshing state... [id=253136607]
module.codelabs.github_issue_label.main[1]: Refreshing state... [id=codelabs:status/mergeable]
module.codelabs.github_issue_label.main[3]: Refreshing state... [id=codelabs:status/wip]
module.codelabs.github_issue_label.main[5]: Refreshing state... [id=codelabs:type/feat]
module.codelabs.github_issue_label.main[2]: Refreshing state... [id=codelabs:status/reviewable]
module.codelabs.github_issue_label.main[4]: Refreshing state... [id=codelabs:type/chore]
module.codelabs.github_issue_label.main[8]: Refreshing state... [id=codelabs:type/refactor]
module.codelabs.github_issue_label.main[9]: Refreshing state... [id=codelabs:type/test]
module.codelabs.github_issue_label.main[6]: Refreshing state... [id=codelabs:type/fix]
module.codelabs.github_issue_label.main[7]: Refreshing state... [id=codelabs:type/question]
module.codelabs.github_issue_label.main[0]: Refreshing state... [id=codelabs:status/depend]
module.JACQUEMINArthur.github_membership.main: Refreshing state... [id=eleven-labs:ArthurJCQ]
module.FRUITDimitri.github_membership.main: Refreshing state... [id=eleven-labs:DimitriMorgan]
module.CIEPKAJeanBaptiste.github_membership.main: Refreshing state... [id=eleven-labs:jbcfrance]
module.SOLOMEmmanuel.github_membership.main: Refreshing state... [id=eleven-labs:manuEleven]
module.ABDELLOULounis.github_membership.main: Refreshing state... [id=eleven-labs:LounisEleven]
module.JOSEPHMarianne.github_membership.main: Refreshing state... [id=eleven-labs:ElevenMarianne]
module.BOTWilson.github_membership.main: Refreshing state... [id=eleven-labs:Bot-Wilson]
module.CADOUXMartin.github_membership.main: Refreshing state... [id=eleven-labs:martincadoux]
module.trainings.github_issue_label.main[4]: Refreshing state... [id=trainings:type/chore]
module.trainings.github_issue_label.main[3]: Refreshing state... [id=trainings:status/wip]
module.trainings.github_issue_label.main[1]: Refreshing state... [id=trainings:status/mergeable]
module.trainings.github_issue_label.main[7]: Refreshing state... [id=trainings:type/question]
module.trainings.github_issue_label.main[5]: Refreshing state... [id=trainings:type/feat]
module.trainings.github_issue_label.main[6]: Refreshing state... [id=trainings:type/fix]
module.trainings.github_issue_label.main[0]: Refreshing state... [id=trainings:status/depend]
module.trainings.github_issue_label.main[9]: Refreshing state... [id=trainings:type/test]
module.trainings.github_issue_label.main[8]: Refreshing state... [id=trainings:type/refactor]
module.trainings.github_issue_label.main[2]: Refreshing state... [id=trainings:status/reviewable]
module.BRENOTPierre.github_membership.main: Refreshing state... [id=eleven-labs:flipper-ananas]
module.typescript-boilerplates.github_issue_label.main[0]: Refreshing state... [id=typescript-boilerplates:status/depend]
module.typescript-boilerplates.github_issue_label.main[9]: Refreshing state... [id=typescript-boilerplates:type/test]
module.typescript-boilerplates.github_issue_label.main[1]: Refreshing state... [id=typescript-boilerplates:status/mergeable]
module.typescript-boilerplates.github_issue_label.main[2]: Refreshing state... [id=typescript-boilerplates:status/reviewable]
module.typescript-boilerplates.github_issue_label.main[4]: Refreshing state... [id=typescript-boilerplates:type/chore]
module.typescript-boilerplates.github_issue_label.main[5]: Refreshing state... [id=typescript-boilerplates:type/feat]
module.typescript-boilerplates.github_issue_label.main[3]: Refreshing state... [id=typescript-boilerplates:status/wip]
module.typescript-boilerplates.github_issue_label.main[6]: Refreshing state... [id=typescript-boilerplates:type/fix]
module.typescript-boilerplates.github_issue_label.main[8]: Refreshing state... [id=typescript-boilerplates:type/refactor]
module.typescript-boilerplates.github_issue_label.main[7]: Refreshing state... [id=typescript-boilerplates:type/question]
module.nebula_react.github_issue_label.main[6]: Refreshing state... [id=nebula-react:type/fix]
module.nebula_react.github_issue_label.main[0]: Refreshing state... [id=nebula-react:status/depend]
module.nebula_react.github_issue_label.main[1]: Refreshing state... [id=nebula-react:status/mergeable]
module.nebula_react.github_issue_label.main[3]: Refreshing state... [id=nebula-react:status/wip]
module.nebula_react.github_issue_label.main[8]: Refreshing state... [id=nebula-react:type/refactor]
module.nebula_react.github_issue_label.main[9]: Refreshing state... [id=nebula-react:type/test]
module.nebula_react.github_issue_label.main[7]: Refreshing state... [id=nebula-react:type/question]
module.nebula_react.github_issue_label.main[4]: Refreshing state... [id=nebula-react:type/chore]
module.nebula_react.github_issue_label.main[2]: Refreshing state... [id=nebula-react:status/reviewable]
module.nebula_react.github_issue_label.main[5]: Refreshing state... [id=nebula-react:type/feat]
module.CUNSOLOGiuseppe.github_membership.main: Refreshing state... [id=eleven-labs:gcunsolo]
module.DUVALDavid.github_membership.main: Refreshing state... [id=eleven-labs:duvaldavid60]
module.wheel-of-fortune.github_issue_label.main[7]: Refreshing state... [id=wheel-of-fortune:type/question]
module.wheel-of-fortune.github_issue_label.main[1]: Refreshing state... [id=wheel-of-fortune:status/mergeable]
module.wheel-of-fortune.github_issue_label.main[6]: Refreshing state... [id=wheel-of-fortune:type/fix]
module.wheel-of-fortune.github_issue_label.main[0]: Refreshing state... [id=wheel-of-fortune:status/depend]
module.wheel-of-fortune.github_issue_label.main[2]: Refreshing state... [id=wheel-of-fortune:status/reviewable]
module.wheel-of-fortune.github_issue_label.main[5]: Refreshing state... [id=wheel-of-fortune:type/feat]
module.wheel-of-fortune.github_issue_label.main[3]: Refreshing state... [id=wheel-of-fortune:status/wip]
module.wheel-of-fortune.github_issue_label.main[9]: Refreshing state... [id=wheel-of-fortune:type/test]
module.wheel-of-fortune.github_issue_label.main[4]: Refreshing state... [id=wheel-of-fortune:type/chore]
module.wheel-of-fortune.github_issue_label.main[8]: Refreshing state... [id=wheel-of-fortune:type/refactor]
module.github.github_issue_label.main[9]: Refreshing state... [id=github:type/test]
module.github.github_issue_label.main[7]: Refreshing state... [id=github:type/question]
module.github.github_issue_label.main[2]: Refreshing state... [id=github:status/reviewable]
module.github.github_issue_label.main[3]: Refreshing state... [id=github:status/wip]
module.github.github_issue_label.main[8]: Refreshing state... [id=github:type/refactor]
module.github.github_issue_label.main[4]: Refreshing state... [id=github:type/chore]
module.github.github_issue_label.main[5]: Refreshing state... [id=github:type/feat]
module.github.github_issue_label.main[6]: Refreshing state... [id=github:type/fix]
module.github.github_issue_label.main[0]: Refreshing state... [id=github:status/depend]
module.github.github_issue_label.main[1]: Refreshing state... [id=github:status/mergeable]
module.design-system.github_issue_label.main[7]: Refreshing state... [id=design-system:type/question]
module.design-system.github_issue_label.main[2]: Refreshing state... [id=design-system:status/reviewable]
module.design-system.github_issue_label.main[6]: Refreshing state... [id=design-system:type/fix]
module.design-system.github_issue_label.main[0]: Refreshing state... [id=design-system:status/depend]
module.design-system.github_issue_label.main[4]: Refreshing state... [id=design-system:type/chore]
module.design-system.github_issue_label.main[5]: Refreshing state... [id=design-system:type/feat]
module.design-system.github_issue_label.main[9]: Refreshing state... [id=design-system:type/test]
module.design-system.github_issue_label.main[3]: Refreshing state... [id=design-system:status/wip]
module.design-system.github_issue_label.main[8]: Refreshing state... [id=design-system:type/refactor]
module.design-system.github_issue_label.main[1]: Refreshing state... [id=design-system:status/mergeable]
module.eslint-config.github_issue_label.main[6]: Refreshing state... [id=eslint-config:type/fix]
module.eslint-config.github_issue_label.main[3]: Refreshing state... [id=eslint-config:status/wip]
module.eslint-config.github_issue_label.main[0]: Refreshing state... [id=eslint-config:status/depend]
module.eslint-config.github_issue_label.main[2]: Refreshing state... [id=eslint-config:status/reviewable]
module.eslint-config.github_issue_label.main[9]: Refreshing state... [id=eslint-config:type/test]
module.eslint-config.github_issue_label.main[7]: Refreshing state... [id=eslint-config:type/question]
module.eslint-config.github_issue_label.main[4]: Refreshing state... [id=eslint-config:type/chore]
module.eslint-config.github_issue_label.main[5]: Refreshing state... [id=eslint-config:type/feat]
module.eslint-config.github_issue_label.main[8]: Refreshing state... [id=eslint-config:type/refactor]
module.eslint-config.github_issue_label.main[1]: Refreshing state... [id=eslint-config:status/mergeable]
module.BELETFabiola.github_membership.main: Refreshing state... [id=eleven-labs:DevFabi]
module.infra.github_issue_label.main[5]: Refreshing state... [id=infra:type/feat]
module.infra.github_issue_label.main[4]: Refreshing state... [id=infra:type/chore]
module.infra.github_issue_label.main[7]: Refreshing state... [id=infra:type/question]
module.infra.github_issue_label.main[2]: Refreshing state... [id=infra:status/reviewable]
module.infra.github_issue_label.main[6]: Refreshing state... [id=infra:type/fix]
module.infra.github_issue_label.main[9]: Refreshing state... [id=infra:type/test]
module.github.github_branch_protection.main[0]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjA2OTUwMDk=]
module.infra.github_issue_label.main[3]: Refreshing state... [id=infra:status/wip]
module.infra.github_issue_label.main[0]: Refreshing state... [id=infra:status/depend]
module.infra.github_issue_label.main[8]: Refreshing state... [id=infra:type/refactor]
module.infra.github_issue_label.main[1]: Refreshing state... [id=infra:status/mergeable]
module.wilsoncodingbattlespace_com.github_issue_label.main[0]: Refreshing state... [id=wilsoncodingbattlespace.com:status/depend]
module.wilsoncodingbattlespace_com.github_issue_label.main[1]: Refreshing state... [id=wilsoncodingbattlespace.com:status/mergeable]
module.wilsoncodingbattlespace_com.github_issue_label.main[3]: Refreshing state... [id=wilsoncodingbattlespace.com:status/wip]
module.wilsoncodingbattlespace_com.github_issue_label.main[4]: Refreshing state... [id=wilsoncodingbattlespace.com:type/chore]
module.wilsoncodingbattlespace_com.github_issue_label.main[2]: Refreshing state... [id=wilsoncodingbattlespace.com:status/reviewable]
module.wilsoncodingbattlespace_com.github_issue_label.main[5]: Refreshing state... [id=wilsoncodingbattlespace.com:type/feat]
module.wilsoncodingbattlespace_com.github_issue_label.main[9]: Refreshing state... [id=wilsoncodingbattlespace.com:type/test]
module.wilsoncodingbattlespace_com.github_issue_label.main[6]: Refreshing state... [id=wilsoncodingbattlespace.com:type/fix]
module.wilsoncodingbattlespace_com.github_issue_label.main[8]: Refreshing state... [id=wilsoncodingbattlespace.com:type/refactor]
module.wilsoncodingbattlespace_com.github_issue_label.main[7]: Refreshing state... [id=wilsoncodingbattlespace.com:type/question]
module.BOILLONYannick.github_membership.main: Refreshing state... [id=eleven-labs:yannickBoillon]
module.eleven-labs_com.github_issue_label.main[0]: Refreshing state... [id=eleven-labs.com:status/depend]
module.eleven-labs_com.github_issue_label.main[8]: Refreshing state... [id=eleven-labs.com:type/refactor]
module.eleven-labs_com.github_issue_label.main[2]: Refreshing state... [id=eleven-labs.com:status/reviewable]
module.eleven-labs_com.github_issue_label.main[5]: Refreshing state... [id=eleven-labs.com:type/feat]
module.eleven-labs_com.github_issue_label.main[6]: Refreshing state... [id=eleven-labs.com:type/fix]
module.eleven-labs_com.github_issue_label.main[7]: Refreshing state... [id=eleven-labs.com:type/question]
module.eleven-labs_com.github_issue_label.main[9]: Refreshing state... [id=eleven-labs.com:type/test]
module.eleven-labs_com.github_issue_label.main[1]: Refreshing state... [id=eleven-labs.com:status/mergeable]
module.eleven-labs_com.github_issue_label.main[3]: Refreshing state... [id=eleven-labs.com:status/wip]
module.eleven-labs_com.github_issue_label.main[4]: Refreshing state... [id=eleven-labs.com:type/chore]
module.KANIANoel.github_membership.main: Refreshing state... [id=eleven-labs:snroki]
module.JARDINETRemy.github_membership.main: Refreshing state... [id=eleven-labs:Pouzor]
module.RAMEAUBenoit.github_membership.main: Refreshing state... [id=eleven-labs:captain-Krook]
module.THIBAULTGuillaume.github_membership.main: Refreshing state... [id=eleven-labs:gthibault2]
module.CORDIERKevin.github_membership.main: Refreshing state... [id=eleven-labs:kevcordier]
module.black_hole.github_issue_label.main[0]: Refreshing state... [id=black-hole:status/depend]
module.black_hole.github_issue_label.main[2]: Refreshing state... [id=black-hole:status/reviewable]
module.black_hole.github_issue_label.main[6]: Refreshing state... [id=black-hole:type/fix]
module.black_hole.github_issue_label.main[3]: Refreshing state... [id=black-hole:status/wip]
module.black_hole.github_issue_label.main[8]: Refreshing state... [id=black-hole:type/refactor]
module.black_hole.github_issue_label.main[7]: Refreshing state... [id=black-hole:type/question]
module.black_hole.github_issue_label.main[5]: Refreshing state... [id=black-hole:type/feat]
module.black_hole.github_issue_label.main[9]: Refreshing state... [id=black-hole:type/test]
module.black_hole.github_issue_label.main[4]: Refreshing state... [id=black-hole:type/chore]
module.black_hole.github_issue_label.main[1]: Refreshing state... [id=black-hole:status/mergeable]
module.MINASYANMarie.github_membership.main: Refreshing state... [id=eleven-labs:MarieMinasyan]
module.DIOURIYounes.github_membership.main: Refreshing state... [id=eleven-labs:younesdiouri]
module.DJOHERRyan.github_membership.main: Refreshing state... [id=eleven-labs:RyanDjo]
module.WALLACEAntoine.github_membership.main: Refreshing state... [id=eleven-labs:Wallaka]
module.LEROUGEPierre.github_membership.main: Refreshing state... [id=eleven-labs:RedPi]
module.BOUCQUETOTYann.github_membership.main: Refreshing state... [id=eleven-labs:YannBqt]
module.GREVINNicolas.github_membership.main: Refreshing state... [id=eleven-labs:nicolas-grevin]
module.BETHMONTThomas.github_membership.main: Refreshing state... [id=eleven-labs:thomasbethmont]
module.BERTHETJeanBaptiste.github_membership.main: Refreshing state... [id=eleven-labs:jb-berthet]
module.FERTDimitri.github_membership.main: Refreshing state... [id=eleven-labs:dimitri-fert]
module.PIERRELOUISMatthieu.github_membership.main: Refreshing state... [id=eleven-labs:M2G]
module.amp-jekyll.github_issue_label.main[0]: Refreshing state... [id=amp-jekyll:status/depend]
module.amp-jekyll.github_issue_label.main[4]: Refreshing state... [id=amp-jekyll:type/chore]
module.amp-jekyll.github_issue_label.main[5]: Refreshing state... [id=amp-jekyll:type/feat]
module.amp-jekyll.github_issue_label.main[2]: Refreshing state... [id=amp-jekyll:status/reviewable]
module.amp-jekyll.github_issue_label.main[6]: Refreshing state... [id=amp-jekyll:type/fix]
module.amp-jekyll.github_issue_label.main[3]: Refreshing state... [id=amp-jekyll:status/wip]
module.amp-jekyll.github_issue_label.main[7]: Refreshing state... [id=amp-jekyll:type/question]
module.amp-jekyll.github_issue_label.main[8]: Refreshing state... [id=amp-jekyll:type/refactor]
module.amp-jekyll.github_issue_label.main[1]: Refreshing state... [id=amp-jekyll:status/mergeable]
module.amp-jekyll.github_issue_label.main[9]: Refreshing state... [id=amp-jekyll:type/test]
module.LENGLETMartin.github_membership.main: Refreshing state... [id=eleven-labs:ulrik59]
module.AMARAAntoine.github_membership.main: Refreshing state... [id=eleven-labs:antoine-amara]
module.MIGEOTDEBARANFabrice.github_membership.main: Refreshing state... [id=eleven-labs:nmss]
module.THUONThierry.github_membership.main: Refreshing state... [id=eleven-labs:lepiaf]
module.MOUTTEAnthony.github_membership.main: Refreshing state... [id=eleven-labs:instabledesign]
module.CHARRONMaeva.github_membership.main: Refreshing state... [id=eleven-labs:mcharron11labs]
module.DEBANDTJulien.github_membership.main: Refreshing state... [id=eleven-labs:Juliendbandt]
module.blog_eleven-labs_com.github_issue_label.main[7]: Refreshing state... [id=blog.eleven-labs.com:type/question]
module.blog_eleven-labs_com.github_issue_label.main[8]: Refreshing state... [id=blog.eleven-labs.com:type/refactor]
module.blog_eleven-labs_com.github_issue_label.main[9]: Refreshing state... [id=blog.eleven-labs.com:type/test]
module.blog_eleven-labs_com.github_issue_label.main[4]: Refreshing state... [id=blog.eleven-labs.com:type/chore]
module.blog_eleven-labs_com.github_issue_label.main[1]: Refreshing state... [id=blog.eleven-labs.com:status/mergeable]
module.blog_eleven-labs_com.github_issue_label.main[0]: Refreshing state... [id=blog.eleven-labs.com:status/depend]
module.blog_eleven-labs_com.github_issue_label.main[2]: Refreshing state... [id=blog.eleven-labs.com:status/reviewable]
module.blog_eleven-labs_com.github_issue_label.main[5]: Refreshing state... [id=blog.eleven-labs.com:type/feat]
module.blog_eleven-labs_com.github_issue_label.main[6]: Refreshing state... [id=blog.eleven-labs.com:type/fix]
module.blog_eleven-labs_com.github_issue_label.main[3]: Refreshing state... [id=blog.eleven-labs.com:status/wip]
module.PEAUDECERFMarion.github_membership.main: Refreshing state... [id=eleven-labs:MarionPdcf]
module.LEROYPierrick.github_membership.main: Refreshing state... [id=eleven-labs:Pier2208]
module.REGAIBIIlyace.github_membership.main: Refreshing state... [id=eleven-labs:RedHotMan]
module.LOVERGNEClement.github_membership.main: Refreshing state... [id=eleven-labs:loverg-c]
module.LALOUMMichael.github_membership.main: Refreshing state... [id=eleven-labs:Maykii11]
module.MENNACristiane.github_membership.main: Refreshing state... [id=eleven-labs:cristianemenna]
module.FEIREISENBenjamin.github_membership.main: Refreshing state... [id=eleven-labs:bfeir]
module.ANDREAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:alex-ception]
module.GORRONCharlesEric.github_membership.main: Refreshing state... [id=eleven-labs:ch3ric]
module.CHARDENALMatthieu.github_membership.main: Refreshing state... [id=eleven-labs:Shad-Z]
module.BERNARDJeremy.github_membership.main: Refreshing state... [id=eleven-labs:BernardJeremy]
module.KONTOMARKOSSophie.github_membership.main: Refreshing state... [id=eleven-labs:breizh81]
module.LABIEDHKaies.github_membership.main: Refreshing state... [id=eleven-labs:kais2503]
module.PASQUETFabien.github_membership.main: Refreshing state... [id=eleven-labs:fpasquet]
module.api-validator.github_repository_webhook.main[2]: Refreshing state... [id=294754360]
module.api-validator.github_repository_webhook.main[1]: Refreshing state... [id=61898918]
module.api-validator.github_repository_webhook.main[0]: Refreshing state... [id=61952561]
module.api-validator.github_issue_label.main[7]: Refreshing state... [id=api-validator:type/question]
module.api-validator.github_issue_label.main[6]: Refreshing state... [id=api-validator:type/fix]
module.api-validator.github_issue_label.main[3]: Refreshing state... [id=api-validator:status/wip]
module.api-validator.github_issue_label.main[9]: Refreshing state... [id=api-validator:type/test]
module.api-validator.github_issue_label.main[8]: Refreshing state... [id=api-validator:type/refactor]
module.api-validator.github_issue_label.main[0]: Refreshing state... [id=api-validator:status/depend]
module.api-validator.github_issue_label.main[1]: Refreshing state... [id=api-validator:status/mergeable]
module.api-validator.github_issue_label.main[5]: Refreshing state... [id=api-validator:type/feat]
module.api-validator.github_issue_label.main[2]: Refreshing state... [id=api-validator:status/reviewable]
module.api-validator.github_issue_label.main[4]: Refreshing state... [id=api-validator:type/chore]
module.DELPEYROUXVictor.github_membership.main: Refreshing state... [id=eleven-labs:Vik-Th0r]
module.DEMELLIERRomain.github_membership.main: Refreshing state... [id=eleven-labs:RomainDemellier]
module.EINHORNStephane.github_membership.main: Refreshing state... [id=eleven-labs:seinhorn]
module.DUNGKevin.github_membership.main: Refreshing state... [id=eleven-labs:KevinDung]
module.WILSON.github_membership.main: Refreshing state... [id=eleven-labs:ElevenWilson]
module.BERRYElsa.github_membership.main: Refreshing state... [id=eleven-labs:ElsaEleven]
module.MOATIJacques.github_membership.main: Refreshing state... [id=eleven-labs:Jmoati]
module.PEJOUTThomas.github_membership.main: Refreshing state... [id=eleven-labs:ElevenTom]
module.jekyll-multiple-languages-plugin.github_issue_label.main[6]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/fix]
module.jekyll-multiple-languages-plugin.github_issue_label.main[2]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/reviewable]
module.jekyll-multiple-languages-plugin.github_issue_label.main[4]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/chore]
module.jekyll-multiple-languages-plugin.github_issue_label.main[7]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/question]
module.jekyll-multiple-languages-plugin.github_issue_label.main[3]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/wip]
module.jekyll-multiple-languages-plugin.github_issue_label.main[9]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/test]
module.jekyll-multiple-languages-plugin.github_issue_label.main[0]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/depend]
module.jekyll-multiple-languages-plugin.github_issue_label.main[1]: Refreshing state... [id=jekyll-multiple-languages-plugin:status/mergeable]
module.jekyll-multiple-languages-plugin.github_issue_label.main[8]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/refactor]
module.jekyll-multiple-languages-plugin.github_issue_label.main[5]: Refreshing state... [id=jekyll-multiple-languages-plugin:type/feat]
module.CLAVIERAnais.github_membership.main: Refreshing state... [id=eleven-labs:Anacla]
module.BESSOUDOSebastien.github_membership.main: Refreshing state... [id=eleven-labs:Sbessoudo]
module.LANAUGregory.github_membership.main: Refreshing state... [id=eleven-labs:glanau]
module.XUAlexandre.github_membership.main: Refreshing state... [id=eleven-labs:Banane95]
module.CANALGuillem.github_membership.main: Refreshing state... [id=eleven-labs:guillemcanal]
module.AMARBenjamin.github_membership.main: Refreshing state... [id=eleven-labs:BenAmarEleven]
module.OUNALLIMarwa.github_membership.main: Refreshing state... [id=eleven-labs:marwaounalli]
module.SURPierre.github_membership.main: Refreshing state... [id=eleven-labs:psur-eleven]
module.POINTURIERLucas.github_membership.main: Refreshing state... [id=eleven-labs:pointu-l]
module.NAULINThomas.github_membership.main: Refreshing state... [id=eleven-labs:ThomasNaulin]
module.TRAPANIMariaEugenia.github_membership.main: Refreshing state... [id=eleven-labs:meugeniatr]
module.GRAILLONRobin.github_membership.main: Refreshing state... [id=eleven-labs:graillus]
module.FLORANTLoris.github_membership.main: Refreshing state... [id=eleven-labs:lorisco]
module.infra_team.github_team_repository.repositories["infra"]: Refreshing state... [id=7595996:infra]
module.developers.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=642624:jekyll-multiple-languages-plugin]
module.developers.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=642624:blog.eleven-labs.com]
module.developers.github_team_repository.repositories["design-system"]: Refreshing state... [id=642624:design-system]
module.developers.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=642624:nebula-react]
module.developers.github_team_repository.repositories["eleven-labs.com"]: Refreshing state... [id=642624:eleven-labs.com]
module.developers.github_team_repository.repositories["api-validator"]: Refreshing state... [id=642624:api-validator]
module.developers.github_team_repository.repositories["wilsoncodingbattlespace.com"]: Refreshing state... [id=642624:wilsoncodingbattlespace.com]
module.developers.github_team_repository.repositories["github"]: Refreshing state... [id=642624:github]
module.developers.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=642624:amp-jekyll]
module.developers.github_team_repository.repositories["black-hole"]: Refreshing state... [id=642624:black-hole]
module.developers.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=642624:wheel-of-fortune]
module.developers.github_team_repository.repositories["codelabs"]: Refreshing state... [id=642624:codelabs]
module.developers.github_team_repository.repositories["typescript-boilerplates"]: Refreshing state... [id=642624:typescript-boilerplates]
module.developers.github_team_repository.repositories["desksharing"]: Refreshing state... [id=642624:desksharing]
module.developers.github_team_repository.repositories["trainings"]: Refreshing state... [id=642624:trainings]
module.developers.github_team_repository.repositories["eslint-config"]: Refreshing state... [id=642624:eslint-config]
module.core.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=540795:amp-jekyll]
module.core.github_team_repository.repositories["infra"]: Refreshing state... [id=540795:infra]
module.core.github_team_repository.repositories["codelabs"]: Refreshing state... [id=540795:codelabs]
module.core.github_team_repository.repositories["desksharing"]: Refreshing state... [id=540795:desksharing]
module.core.github_team_repository.repositories["github"]: Refreshing state... [id=540795:github]
module.core.github_team_repository.repositories["design-system"]: Refreshing state... [id=540795:design-system]
module.core.github_team_repository.repositories["trainings"]: Refreshing state... [id=540795:trainings]
module.core.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=540795:jekyll-multiple-languages-plugin]
module.blog_eleven-labs_com.github_branch_protection.main[0]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTEyMjI4NA==]
module.core.github_team_repository.repositories["eslint-config"]: Refreshing state... [id=540795:eslint-config]
module.core.github_team_repository.repositories["eleven-labs.com"]: Refreshing state... [id=540795:eleven-labs.com]
module.core.github_team_repository.repositories["black-hole"]: Refreshing state... [id=540795:black-hole]
module.core.github_team_repository.repositories["wilsoncodingbattlespace.com"]: Refreshing state... [id=540795:wilsoncodingbattlespace.com]
module.core.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=540795:nebula-react]
module.core.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=540795:wheel-of-fortune]
module.core.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=540795:blog.eleven-labs.com]
module.core.github_team_repository.repositories["typescript-boilerplates"]: Refreshing state... [id=540795:typescript-boilerplates]
module.codelabs.github_branch_protection.main[0]: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlOTQ3Njkx]
module.core.github_team_repository.repositories["api-validator"]: Refreshing state... [id=540795:api-validator]
module.hq.github_team_repository.repositories["eslint-config"]: Refreshing state... [id=2362575:eslint-config]
module.hq.github_team_repository.repositories["black-hole"]: Refreshing state... [id=2362575:black-hole]
module.hq.github_team_repository.repositories["codelabs"]: Refreshing state... [id=2362575:codelabs]
module.hq.github_team_repository.repositories["blog.eleven-labs.com"]: Refreshing state... [id=2362575:blog.eleven-labs.com]
module.hq.github_team_repository.repositories["api-validator"]: Refreshing state... [id=2362575:api-validator]
module.hq.github_team_repository.repositories["nebula-react"]: Refreshing state... [id=2362575:nebula-react]
module.hq.github_team_repository.repositories["github"]: Refreshing state... [id=2362575:github]
module.hq.github_team_repository.repositories["wheel-of-fortune"]: Refreshing state... [id=2362575:wheel-of-fortune]
module.hq.github_team_repository.repositories["eleven-labs.com"]: Refreshing state... [id=2362575:eleven-labs.com]
module.hq.github_team_repository.repositories["amp-jekyll"]: Refreshing state... [id=2362575:amp-jekyll]
module.hq.github_team_repository.repositories["design-system"]: Refreshing state... [id=2362575:design-system]
module.hq.github_team_repository.repositories["jekyll-multiple-languages-plugin"]: Refreshing state... [id=2362575:jekyll-multiple-languages-plugin]
module.hq.github_team_repository.repositories["trainings"]: Refreshing state... [id=2362575:trainings]
module.hq.github_team_repository.repositories["typescript-boilerplates"]: Refreshing state... [id=2362575:typescript-boilerplates]
module.hq.github_team_repository.repositories["wilsoncodingbattlespace.com"]: Refreshing state... [id=2362575:wilsoncodingbattlespace.com]
module.hq.github_team_repository.repositories["desksharing"]: Refreshing state... [id=2362575:desksharing]
module.hq.github_team_membership.members["BenAmarEleven"]: Refreshing state... [id=2362575:BenAmarEleven]
module.hq.github_team_membership.members["ElevenTom"]: Refreshing state... [id=2362575:ElevenTom]
module.hq.github_team_membership.members["ElevenWilson"]: Refreshing state... [id=2362575:ElevenWilson]
module.hq.github_team_membership.members["ElsaEleven"]: Refreshing state... [id=2362575:ElsaEleven]
module.hq.github_team_membership.members["Maykii11"]: Refreshing state... [id=2362575:Maykii11]
module.hq.github_team_membership.members["Anacla"]: Refreshing state... [id=2362575:Anacla]
module.core.github_team_membership.members["Pouzor"]: Refreshing state... [id=540795:Pouzor]
module.core.github_team_membership.members["ch3ric"]: Refreshing state... [id=540795:ch3ric]
module.core.github_team_membership.members["fpasquet"]: Refreshing state... [id=540795:fpasquet]
module.core.github_team_membership.members["graillus"]: Refreshing state... [id=540795:graillus]
module.core.github_team_membership.members["nicolas-grevin"]: Refreshing state... [id=540795:nicolas-grevin]
module.core.github_team_membership.members["snroki"]: Refreshing state... [id=540795:snroki]
module.core.github_team_membership.members["Bot-Wilson"]: Refreshing state... [id=540795:Bot-Wilson]
module.infra_team.github_team_membership.members["fpasquet"]: Refreshing state... [id=7595996:fpasquet]
module.infra_team.github_team_membership.members["graillus"]: Refreshing state... [id=7595996:graillus]
module.infra_team.github_team_membership.members["snroki"]: Refreshing state... [id=7595996:snroki]
module.infra_team.github_team_membership.members["ch3ric"]: Refreshing state... [id=7595996:ch3ric]
module.infra_team.github_team_membership.members["nicolas-grevin"]: Refreshing state... [id=7595996:nicolas-grevin]
module.infra_team.github_team_membership.members["Pouzor"]: Refreshing state... [id=7595996:Pouzor]
module.infra_team.github_team_membership.members["Bot-Wilson"]: Refreshing state... [id=7595996:Bot-Wilson]
module.infra_team.github_team_membership.members["cristianemenna"]: Refreshing state... [id=7595996:cristianemenna]
module.developers.github_team_membership.members["flipper-ananas"]: Refreshing state... [id=642624:flipper-ananas]
module.developers.github_team_membership.members["psur-eleven"]: Refreshing state... [id=642624:psur-eleven]
module.developers.github_team_membership.members["jbcfrance"]: Refreshing state... [id=642624:jbcfrance]
module.developers.github_team_membership.members["graillus"]: Refreshing state... [id=642624:graillus]
module.developers.github_team_membership.members["ElevenMarianne"]: Refreshing state... [id=642624:ElevenMarianne]
module.developers.github_team_membership.members["ThomasNaulin"]: Refreshing state... [id=642624:ThomasNaulin]
module.developers.github_team_membership.members["Vik-Th0r"]: Refreshing state... [id=642624:Vik-Th0r]
module.developers.github_team_membership.members["guillemcanal"]: Refreshing state... [id=642624:guillemcanal]
module.developers.github_team_membership.members["kais2503"]: Refreshing state... [id=642624:kais2503]
module.developers.github_team_membership.members["snroki"]: Refreshing state... [id=642624:snroki]
module.developers.github_team_membership.members["RyanDjo"]: Refreshing state... [id=642624:RyanDjo]
module.developers.github_team_membership.members["gcunsolo"]: Refreshing state... [id=642624:gcunsolo]
module.developers.github_team_membership.members["cristianemenna"]: Refreshing state... [id=642624:cristianemenna]
module.developers.github_team_membership.members["Pier2208"]: Refreshing state... [id=642624:Pier2208]
module.developers.github_team_membership.members["YannBqt"]: Refreshing state... [id=642624:YannBqt]
module.developers.github_team_membership.members["ch3ric"]: Refreshing state... [id=642624:ch3ric]
module.developers.github_team_membership.members["alex-ception"]: Refreshing state... [id=642624:alex-ception]
module.developers.github_team_membership.members["jb-berthet"]: Refreshing state... [id=642624:jb-berthet]
module.developers.github_team_membership.members["fpasquet"]: Refreshing state... [id=642624:fpasquet]
module.developers.github_team_membership.members["lepiaf"]: Refreshing state... [id=642624:lepiaf]
module.developers.github_team_membership.members["Jmoati"]: Refreshing state... [id=642624:Jmoati]
module.developers.github_team_membership.members["gthibault2"]: Refreshing state... [id=642624:gthibault2]
module.developers.github_team_membership.members["Juliendbandt"]: Refreshing state... [id=642624:Juliendbandt]
module.developers.github_team_membership.members["nmss"]: Refreshing state... [id=642624:nmss]
module.developers.github_team_membership.members["lorisco"]: Refreshing state... [id=642624:lorisco]
module.developers.github_team_membership.members["martincadoux"]: Refreshing state... [id=642624:martincadoux]
module.developers.github_team_membership.members["antoine-amara"]: Refreshing state... [id=642624:antoine-amara]
module.developers.github_team_membership.members["marwaounalli"]: Refreshing state... [id=642624:marwaounalli]
module.developers.github_team_membership.members["pointu-l"]: Refreshing state... [id=642624:pointu-l]
module.developers.github_team_membership.members["BernardJeremy"]: Refreshing state... [id=642624:BernardJeremy]
module.developers.github_team_membership.members["Wallaka"]: Refreshing state... [id=642624:Wallaka]
module.developers.github_team_membership.members["captain-Krook"]: Refreshing state... [id=642624:captain-Krook]
module.developers.github_team_membership.members["glanau"]: Refreshing state... [id=642624:glanau]
module.developers.github_team_membership.members["Anacla"]: Refreshing state... [id=642624:Anacla]
module.developers.github_team_membership.members["younesdiouri"]: Refreshing state... [id=642624:younesdiouri]
module.developers.github_team_membership.members["KevinDung"]: Refreshing state... [id=642624:KevinDung]
module.developers.github_team_membership.members["yannickBoillon"]: Refreshing state... [id=642624:yannickBoillon]
module.developers.github_team_membership.members["loverg-c"]: Refreshing state... [id=642624:loverg-c]
module.developers.github_team_membership.members["MarieMinasyan"]: Refreshing state... [id=642624:MarieMinasyan]
module.developers.github_team_membership.members["M2G"]: Refreshing state... [id=642624:M2G]
module.developers.github_team_membership.members["seinhorn"]: Refreshing state... [id=642624:seinhorn]
module.developers.github_team_membership.members["RedHotMan"]: Refreshing state... [id=642624:RedHotMan]
module.developers.github_team_membership.members["bfeir"]: Refreshing state... [id=642624:bfeir]
module.developers.github_team_membership.members["nicolas-grevin"]: Refreshing state... [id=642624:nicolas-grevin]
module.developers.github_team_membership.members["Pouzor"]: Refreshing state... [id=642624:Pouzor]
module.developers.github_team_membership.members["Shad-Z"]: Refreshing state... [id=642624:Shad-Z]
module.developers.github_team_membership.members["DimitriMorgan"]: Refreshing state... [id=642624:DimitriMorgan]
module.developers.github_team_membership.members["RomainDemellier"]: Refreshing state... [id=642624:RomainDemellier]
module.developers.github_team_membership.members["aallier"]: Refreshing state... [id=642624:aallier]
module.developers.github_team_membership.members["LounisEleven"]: Refreshing state... [id=642624:LounisEleven]
module.developers.github_team_membership.members["ArthurJCQ"]: Refreshing state... [id=642624:ArthurJCQ]
module.developers.github_team_membership.members["instabledesign"]: Refreshing state... [id=642624:instabledesign]
module.developers.github_team_membership.members["breizh81"]: Refreshing state... [id=642624:breizh81]
module.developers.github_team_membership.members["mcharron11labs"]: Refreshing state... [id=642624:mcharron11labs]
module.developers.github_team_membership.members["Sbessoudo"]: Refreshing state... [id=642624:Sbessoudo]
module.developers.github_team_membership.members["ulrik59"]: Refreshing state... [id=642624:ulrik59]
module.developers.github_team_membership.members["kevcordier"]: Refreshing state... [id=642624:kevcordier]
module.developers.github_team_membership.members["dimitri-fert"]: Refreshing state... [id=642624:dimitri-fert]
module.developers.github_team_membership.members["meugeniatr"]: Refreshing state... [id=642624:meugeniatr]
module.developers.github_team_membership.members["manuEleven"]: Refreshing state... [id=642624:manuEleven]
module.developers.github_team_membership.members["RedPi"]: Refreshing state... [id=642624:RedPi]
module.developers.github_team_membership.members["Bot-Wilson"]: Refreshing state... [id=642624:Bot-Wilson]
module.developers.github_team_membership.members["thomasbethmont"]: Refreshing state... [id=642624:thomasbethmont]
module.developers.github_team_membership.members["duvaldavid60"]: Refreshing state... [id=642624:duvaldavid60]
module.developers.github_team_membership.members["Banane95"]: Refreshing state... [id=642624:Banane95]
module.developers.github_team_membership.members["MarionPdcf"]: Refreshing state... [id=642624:MarionPdcf]
module.developers.github_team_membership.members["DevFabi"]: Refreshing state... [id=642624:DevFabi]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.amp-jekyll.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "amp-jekyll"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.amp-jekyll.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "amp-jekyll"
    }

  # module.api-validator.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "api-validator"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.api-validator.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "api-validator"
    }

  # module.api-validator.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
        delete_branch_on_merge      = false
        description                 = "Provide helpers that validate a request against an OpenAPi/Swagger2 API description"
        etag                        = "W/\"528a7197435e3cbba375e3d0272aa1191940013c93077d07a38a91b84d353724\""
        full_name                   = "eleven-labs/api-validator"
        git_clone_url               = "git://github.com/eleven-labs/api-validator.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = false
        has_wiki                    = true
        html_url                    = "https://github.com/eleven-labs/api-validator"
        http_clone_url              = "https://github.com/eleven-labs/api-validator.git"
        id                          = "api-validator"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "api-validator"
        node_id                     = "MDEwOlJlcG9zaXRvcnk2NDI5NDYzMQ=="
        private                     = false
        repo_id                     = 64294631
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/api-validator.git"
        svn_url                     = "https://github.com/eleven-labs/api-validator"
        topics                      = []
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

        security_and_analysis {

            secret_scanning {
                status = "disabled"
            }

            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # module.black_hole.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "black-hole"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.black_hole.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "black-hole"
    }

  # module.black_hole.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
      + allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
      + delete_branch_on_merge      = false
        description                 = "WilsonBook Back-end"
        etag                        = "W/\"889da3828dffae34ca1949697b43b1bb903b0b0b6627b886ae62b1058f195d0e\""
        full_name                   = "eleven-labs/black-hole"
        git_clone_url               = "git://github.com/eleven-labs/black-hole.git"
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://planets-bo.eleven-labs.com"
        html_url                    = "https://github.com/eleven-labs/black-hole"
        http_clone_url              = "https://github.com/eleven-labs/black-hole.git"
        id                          = "black-hole"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "black-hole"
        private                     = true
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/black-hole.git"
        svn_url                     = "https://github.com/eleven-labs/black-hole"
        topics                      = []
      + visibility                  = "private"
    }

  # module.blog_eleven-labs_com.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "blog.eleven-labs.com"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.blog_eleven-labs_com.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "blog.eleven-labs.com"
    }

  # module.blog_eleven-labs_com.github_branch_protection.main[0] must be replaced
-/+ resource "github_branch_protection" "main" {
        allows_deletions                = false
        allows_force_pushes             = false
        blocks_creations                = false
        enforce_admins                  = false
      ~ id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMTEyMjI4NA==" -> (known after apply)
        lock_branch                     = false
        pattern                         = "master"
      ~ push_restrictions               = [
          - "/ElevenTom",
          + "16896128",
        ]
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnk4NjY5NDg1NA==" -> "blog.eleven-labs.com" # forces replacement
        require_conversation_resolution = false
        require_signed_commits          = false
        required_linear_history         = false

      ~ required_pull_request_reviews {
            dismiss_stale_reviews           = false
          ~ dismissal_restrictions          = [
              - "/ElevenTom",
              + "16896128",
            ]
          - pull_request_bypassers          = [] -> null
            require_code_owner_reviews      = false
            require_last_push_approval      = false
            required_approving_review_count = 1
          - restrict_dismissals             = true -> null
        }

        required_status_checks {
            contexts = [
                "deploy",
            ]
            strict   = true
        }
    }

  # module.blog_eleven-labs_com.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
        delete_branch_on_merge      = false
        description                 = "Eleven-labs blog"
        etag                        = "W/\"c2747b4ac83cd116846108879a8a440f1675a83cff4d21f5a671933a5e7e1742\""
        full_name                   = "eleven-labs/blog.eleven-labs.com"
        git_clone_url               = "git://github.com/eleven-labs/blog.eleven-labs.com.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = false
        has_wiki                    = true
        homepage_url                = "https://blog.eleven-labs.com"
        html_url                    = "https://github.com/eleven-labs/blog.eleven-labs.com"
        http_clone_url              = "https://github.com/eleven-labs/blog.eleven-labs.com.git"
        id                          = "blog.eleven-labs.com"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "blog.eleven-labs.com"
        node_id                     = "MDEwOlJlcG9zaXRvcnk4NjY5NDg1NA=="
        private                     = false
        repo_id                     = 86694854
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/blog.eleven-labs.com.git"
        svn_url                     = "https://github.com/eleven-labs/blog.eleven-labs.com"
        topics                      = [
            "article",
            "blog",
            "jekyll",
            "le-blog",
        ]
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

      - pages {
          - cname      = "blog.eleven-labs.com" -> null
          - custom_404 = false -> null
          - html_url   = "http://blog.eleven-labs.com/" -> null
          - status     = "built" -> null
          - url        = "https://api.github.com/repos/eleven-labs/blog.eleven-labs.com/pages" -> null

          - source {
              - branch = "gh-pages" -> null
              - path   = "/" -> null
            }
        }

        security_and_analysis {

            secret_scanning {
                status = "disabled"
            }

            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # module.codelabs.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "codelabs"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.codelabs.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "codelabs"
    }

  # module.codelabs.github_branch_protection.main[0] must be replaced
-/+ resource "github_branch_protection" "main" {
        allows_deletions                = false
        allows_force_pushes             = false
        blocks_creations                = false
        enforce_admins                  = false
      ~ id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlOTQ3Njkx" -> (known after apply)
        lock_branch                     = false
        pattern                         = "master"
      ~ push_restrictions               = [
          - "/ElevenTom",
          + "16896128",
        ]
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnk5NTg3MzAzNA==" -> "codelabs" # forces replacement
        require_conversation_resolution = false
        require_signed_commits          = false
        required_linear_history         = false

      ~ required_pull_request_reviews {
            dismiss_stale_reviews           = false
          ~ dismissal_restrictions          = [
              - "/ElevenTom",
              + "16896128",
            ]
          - pull_request_bypassers          = [] -> null
            require_code_owner_reviews      = false
            require_last_push_approval      = false
            required_approving_review_count = 1
          - restrict_dismissals             = true -> null
        }

        required_status_checks {
            contexts = [
                "ci/circleci: node8",
            ]
            strict   = true
        }
    }

  # module.codelabs.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
        delete_branch_on_merge      = false
        etag                        = "W/\"72434e3159fcb8c9712133c28908478c3f3e7ca370c8eb260ee239b7d0d4a988\""
        full_name                   = "eleven-labs/codelabs"
        git_clone_url               = "git://github.com/eleven-labs/codelabs.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/eleven-labs/codelabs"
        http_clone_url              = "https://github.com/eleven-labs/codelabs.git"
        id                          = "codelabs"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "codelabs"
        node_id                     = "MDEwOlJlcG9zaXRvcnk5NTg3MzAzNA=="
        private                     = false
        repo_id                     = 95873034
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/codelabs.git"
        svn_url                     = "https://github.com/eleven-labs/codelabs"
        topics                      = []
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

        security_and_analysis {

            secret_scanning {
                status = "disabled"
            }

            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # module.design-system.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "design-system"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.design-system.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "design-system"
    }

  # module.design-system.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
      ~ allow_auto_merge            = true -> false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      - allow_update_branch         = true -> null
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
      ~ delete_branch_on_merge      = true -> false
        description                 = "Eleven Labs - Design System"
        etag                        = "W/\"eccf010d1e5e0cbe256f0104c7a867f03ee22b8b3e4fce9e3e86ff6e5cf7262a\""
        full_name                   = "eleven-labs/design-system"
        git_clone_url               = "git://github.com/eleven-labs/design-system.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://eleven-labs.github.io/design-system/"
        html_url                    = "https://github.com/eleven-labs/design-system"
        http_clone_url              = "https://github.com/eleven-labs/design-system.git"
        id                          = "design-system"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "design-system"
        node_id                     = "R_kgDOIeZ78w"
        private                     = false
        repo_id                     = 568753139
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/design-system.git"
        svn_url                     = "https://github.com/eleven-labs/design-system"
        topics                      = []
        visibility                  = "public"
        vulnerability_alerts        = false

      - pages {
          - custom_404 = false -> null
          - html_url   = "https://eleven-labs.github.io/design-system/" -> null
          - status     = "built" -> null
          - url        = "https://api.github.com/repos/eleven-labs/design-system/pages" -> null

          - source {
              - branch = "gh-pages" -> null
              - path   = "/" -> null
            }
        }

        security_and_analysis {

            secret_scanning {
                status = "disabled"
            }

            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # module.desksharing.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "desksharing"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.desksharing.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "desksharing"
    }

  # module.desksharing.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
      + allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
      + delete_branch_on_merge      = false
        etag                        = "W/\"bd56d870c958e4de7b048fe7dde576121dac0dcdb315ddcd569c21cea4978ebc\""
        full_name                   = "eleven-labs/desksharing"
        git_clone_url               = "git://github.com/eleven-labs/desksharing.git"
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/eleven-labs/desksharing"
        http_clone_url              = "https://github.com/eleven-labs/desksharing.git"
        id                          = "desksharing"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "desksharing"
        private                     = true
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/desksharing.git"
        svn_url                     = "https://github.com/eleven-labs/desksharing"
        topics                      = []
      + visibility                  = "private"
    }

  # module.eleven-labs_com.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "eleven-labs.com"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.eleven-labs_com.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "eleven-labs.com"
    }

  # module.eleven-labs_com.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
        delete_branch_on_merge      = false
        description                 = "https://eleven-labs.com website"
        etag                        = "W/\"ae5c9182331266b7db711b72a5443fe763bbd5f6e87202ce0b7988dd8c026a71\""
        full_name                   = "eleven-labs/eleven-labs.com"
        git_clone_url               = "git://github.com/eleven-labs/eleven-labs.com.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
      ~ has_wiki                    = false -> true
        homepage_url                = "https://eleven-labs.com"
        html_url                    = "https://github.com/eleven-labs/eleven-labs.com"
        http_clone_url              = "https://github.com/eleven-labs/eleven-labs.com.git"
        id                          = "eleven-labs.com"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "eleven-labs.com"
        node_id                     = "R_kgDOGHyRqw"
        private                     = true
        repo_id                     = 410816939
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/eleven-labs.com.git"
        svn_url                     = "https://github.com/eleven-labs/eleven-labs.com"
        topics                      = []
        visibility                  = "private"
        vulnerability_alerts        = false
    }

  # module.eslint-config.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "eslint-config"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.eslint-config.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "eslint-config"
    }

  # module.github.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "github"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.github.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "github"
    }

  # module.github.github_branch_protection.main[0] must be replaced
-/+ resource "github_branch_protection" "main" {
        allows_deletions                = false
        allows_force_pushes             = false
        blocks_creations                = false
        enforce_admins                  = true
      ~ id                              = "MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjA2OTUwMDk=" -> (known after apply)
        lock_branch                     = false
        pattern                         = "master"
      - push_restrictions               = [] -> null
      ~ repository_id                   = "MDEwOlJlcG9zaXRvcnkyMjg0ODMxNzA=" -> "github" # forces replacement
        require_conversation_resolution = false
        require_signed_commits          = true
        required_linear_history         = false

      ~ required_pull_request_reviews {
            dismiss_stale_reviews           = false
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
            require_code_owner_reviews      = false
            require_last_push_approval      = false
            required_approving_review_count = 1
          - restrict_dismissals             = true -> null
        }

        required_status_checks {
            contexts = [
                "terraform",
            ]
            strict   = true
        }
    }

  # module.github.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
        delete_branch_on_merge      = false
        description                 = "github organization management with terraform"
        etag                        = "W/\"4e4ff5d945d9a55927723f1f1c02b5e4fab53f2d787458d8bb09bb6bea782555\""
        full_name                   = "eleven-labs/github"
        git_clone_url               = "git://github.com/eleven-labs/github.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/eleven-labs/github"
        http_clone_url              = "https://github.com/eleven-labs/github.git"
        id                          = "github"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "github"
        node_id                     = "MDEwOlJlcG9zaXRvcnkyMjg0ODMxNzA="
        private                     = false
        repo_id                     = 228483170
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/github.git"
        svn_url                     = "https://github.com/eleven-labs/github"
        topics                      = [
            "github",
            "terraform",
        ]
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

        security_and_analysis {

            secret_scanning {
                status = "disabled"
            }

            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # module.infra.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "infra"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.infra.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "infra"
    }

  # module.infra.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
      + allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
      + delete_branch_on_merge      = false
        description                 = "infra configuration with terraform"
        etag                        = "W/\"61003d1fa740c12a22f469db3460f9db7f46994a24df51634714e5f56e054d7a\""
        full_name                   = "eleven-labs/infra"
        git_clone_url               = "git://github.com/eleven-labs/infra.git"
        has_downloads               = true
        has_issues                  = true
        has_projects                = false
        has_wiki                    = true
        html_url                    = "https://github.com/eleven-labs/infra"
        http_clone_url              = "https://github.com/eleven-labs/infra.git"
        id                          = "infra"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "infra"
        private                     = true
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/infra.git"
        svn_url                     = "https://github.com/eleven-labs/infra"
        topics                      = [
            "aws",
            "gcp",
            "terraform",
        ]
      + visibility                  = "private"
    }

  # module.jekyll-multiple-languages-plugin.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "jekyll-multiple-languages-plugin"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.jekyll-multiple-languages-plugin.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "jekyll-multiple-languages-plugin"
    }

  # module.nebula_react.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "nebula-react"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.nebula_react.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "nebula-react"
    }

  # module.nebula_react.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
      + allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
      + delete_branch_on_merge      = false
        description                 = "WilsonBook Front-end"
        etag                        = "W/\"3aaaddd71dea42a333c28796e40e0320be91d5a39314d1a9eb8299d316bd7528\""
        full_name                   = "eleven-labs/nebula-react"
        git_clone_url               = "git://github.com/eleven-labs/nebula-react.git"
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        homepage_url                = "https://planets.eleven-labs.com"
        html_url                    = "https://github.com/eleven-labs/nebula-react"
        http_clone_url              = "https://github.com/eleven-labs/nebula-react.git"
        id                          = "nebula-react"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "nebula-react"
        private                     = true
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/nebula-react.git"
        svn_url                     = "https://github.com/eleven-labs/nebula-react"
        topics                      = []
      + visibility                  = "private"
    }

  # module.trainings.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "trainings"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.trainings.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "trainings"
    }

  # module.trainings.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
      + allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "main"
      + delete_branch_on_merge      = false
        description                 = "Wilson trainings"
        etag                        = "W/\"1a320f246e7475e793a8a30e2fe6735a081dcb7fcdcde35fa40a50d118d91df4\""
        full_name                   = "eleven-labs/trainings"
        git_clone_url               = "git://github.com/eleven-labs/trainings.git"
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/eleven-labs/trainings"
        http_clone_url              = "https://github.com/eleven-labs/trainings.git"
        id                          = "trainings"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "trainings"
        private                     = true
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/trainings.git"
        svn_url                     = "https://github.com/eleven-labs/trainings"
        topics                      = []
      + visibility                  = "private"
    }

  # module.typescript-boilerplates.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "typescript-boilerplates"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.typescript-boilerplates.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "typescript-boilerplates"
    }

  # module.wheel-of-fortune.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "wheel-of-fortune"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.wheel-of-fortune.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "wheel-of-fortune"
    }

  # module.wheel-of-fortune.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
        allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        allow_update_branch         = false
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
        delete_branch_on_merge      = false
        etag                        = "W/\"ecc8ec4ae019ca18d352c7973e5ed7937e4f5357f03efe73007274c53a354e24\""
        full_name                   = "eleven-labs/wheel-of-fortune"
        git_clone_url               = "git://github.com/eleven-labs/wheel-of-fortune.git"
        has_discussions             = false
        has_downloads               = true
        has_issues                  = true
        has_projects                = true
        has_wiki                    = true
        html_url                    = "https://github.com/eleven-labs/wheel-of-fortune"
        http_clone_url              = "https://github.com/eleven-labs/wheel-of-fortune.git"
        id                          = "wheel-of-fortune"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "wheel-of-fortune"
        node_id                     = "MDEwOlJlcG9zaXRvcnkzNzA2NTExMQ=="
        private                     = false
        repo_id                     = 37065111
        squash_merge_commit_message = "COMMIT_MESSAGES"
        squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/wheel-of-fortune.git"
        svn_url                     = "https://github.com/eleven-labs/wheel-of-fortune"
        topics                      = []
        visibility                  = "public"
      - vulnerability_alerts        = true -> null

        security_and_analysis {

            secret_scanning {
                status = "disabled"
            }

            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # module.wilsoncodingbattlespace_com.github_branch.main will be created
  + resource "github_branch" "main" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "wilsoncodingbattlespace.com"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.wilsoncodingbattlespace_com.github_branch_default.main will be created
  + resource "github_branch_default" "main" {
      + branch     = "master"
      + id         = (known after apply)
      + rename     = false
      + repository = "wilsoncodingbattlespace.com"
    }

  # module.wilsoncodingbattlespace_com.github_repository.main will be updated in-place
  ~ resource "github_repository" "main" {
      + allow_auto_merge            = false
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
        archived                    = false
        auto_init                   = false
        default_branch              = "master"
      + delete_branch_on_merge      = false
        description                 = "Site WCB"
        etag                        = "W/\"49c812ccdd262b8205b6471d1a19825f62343fa8c7854a9c919f499f5376c558\""
        full_name                   = "eleven-labs/wilsoncodingbattlespace.com"
        git_clone_url               = "git://github.com/eleven-labs/wilsoncodingbattlespace.com.git"
        has_downloads               = true
        has_issues                  = true
        has_projects                = false
        has_wiki                    = true
        homepage_url                = "http://wilsoncodingbattlespace.com/"
        html_url                    = "https://github.com/eleven-labs/wilsoncodingbattlespace.com"
        http_clone_url              = "https://github.com/eleven-labs/wilsoncodingbattlespace.com.git"
        id                          = "wilsoncodingbattlespace.com"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "wilsoncodingbattlespace.com"
        private                     = true
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        ssh_clone_url               = "git@github.com:eleven-labs/wilsoncodingbattlespace.com.git"
        svn_url                     = "https://github.com/eleven-labs/wilsoncodingbattlespace.com"
        topics                      = []
      + visibility                  = "private"
    }

Plan: 37 to add, 13 to change, 3 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @nicolas-grevin, Action: `pull_request`, Workflow: `terraform`*